#include "header.h"

int character_select()
{
	int selectNum = 0;
	int num = 0;
	printf("=====================================  Game Story  ===================================\n\n");
	printf("  전국의 영재들이 모인다는 건국대학교,\n\n");
	printf("  그 안에서도 진짜들만 모인다는 컴퓨터공학부에 시험기간이 찾아왔다.\n\n");
	printf("  그런데 이번 시험은 이전과는 다른 점이 있다는데..\n\n");
	printf("  그것은 자신의 특기를 살린다면 어떠한 수단과 방법을 가리지 않고 이용 가능하다는 것!\n\n");
	printf("  각 분야를 희망하는 천재들 사이에서, 최고의 학점을 쟁취하라!\n\n");
	printf("======================================================================================\n");
	system("pause");
	
	do
	{
		system("cls");
		printf("================== 캐릭터 선택창 ==================\n\n");
		printf("  캐릭터의 설명을 보고 선택을 할 수 있습니다.\n");
		printf("  캐릭터 설명, 선택은 1 ~ 4 를 눌러주세요.\n\n");
		printf("  1. 빅데이터 전문가 \n");
		printf("  2. 인공지능 전문가 \n");
		printf("  3. 소프트웨어개발 전문가 \n");
		printf("  4. 컴퓨터보안 전문가 \n\n");
		printf("===================================================\n");
		selectNum = chooseNumber(1, 4);

		switch (selectNum)
		{
		case 1:
		{
			printf("================================== 캐릭터 설명창 ==================================\n\n");
			printf("  [빅데이터 전문가] \n\n");
			printf("  ⊙ 특수능력: 빅데이터를 분석하여 다음 단어가 무엇인지 지속적으로 볼 수 있다.\n");
			printf("  ⊙ 사용 횟수: 무제한\n\n");
			printf("  캐릭터를 선택하시겠습니까? Yes: 1 / No: 2 입력\n\n");
			printf("===================================================================================\n");
			num = chooseNumber(1, 2);
			if (num == 1)
			{
				printf("===================================================================\n");
				printf("  빅데이터 전문가를 선택 하셨습니다.\n");
				printf("===================================================================\n");
				system("pause");
				return 1;
			}
			if (num == 2)
				break;
			break;
		}


		case 2:
		{
			printf("================================== 캐릭터 설명창 ==================================\n\n");
			printf("  [인공지능 전문가] \n\n");
			printf("  ⊙ 특수능력: space 키를 누르면 인공지능을 이용해 3문제 연속으로 자동 입력을 한다.\n");
			printf("    하지만 시간이 3초나 걸리기 때문에 좋은 점수를 받지 못할수도 있다.\n");
			printf("  ⊙ 사용 횟수: 1회\n\n");
			printf("  캐릭터를 선택하시겠습니까? Yes: 1 / No: 2 입력\n\n");
			printf("===================================================================================\n");
			num = chooseNumber(1, 2);
			if (num == 1)
			{
				printf("===================================================================\n");
				printf("  인공지능 전문가를 선택 하셨습니다.\n");
				printf("===================================================================\n");
				system("pause");
				return 2;
			}
			if (num == 2)
				break;
				
			break;
		}

		case 3:
		{
			printf("========================== 캐릭터 설명창 ==========================\n\n");
			printf("  [소프트웨어개발 전문가] \n\n");
			printf("  ⊙ 특수능력: space 키를 누르면 다음 문제에 쉬운 단어가 나오도록 코드를 수정한다.\n");
			printf("  ⊙ 사용 횟수: 3회\n\n");
			printf("  캐릭터를 선택하시겠습니까? Yes: 1 / No: 2 입력\n\n");
			printf("===================================================================\n");
			num = chooseNumber(1, 2);
			if (num == 1)
			{
				printf("===================================================================\n");
				printf("  소프트웨어개발 전문가를 선택 하셨습니다.\n");
				printf("===================================================================\n");
				system("pause");
				return 3;
			}
			if (num == 2)
				break;
			break;
		}

		case 4:
		{
			printf("========================== 캐릭터 설명창 ==========================\n\n");
			printf("  [컴퓨터보안 전문가] \n\n");
			printf("  ⊙ 특수능력: 문제를 틀릴 시 해킹을 통해 자동으로 맞게 고친다.\n");
			printf("  ⊙ 사용 횟수: 2회\n\n");
			printf("  캐릭터를 선택하시겠습니까? Yes: 1 / No: 2 입력\n\n");
			printf("===================================================================\n");
			num = chooseNumber(1, 2);
			if (num == 1)
			{
				printf("===================================================================\n");
				printf("  컴퓨터보안 전문가를 선택 하셨습니다.\n");
				printf("===================================================================\n");
				system("pause");
				return 4;
			}
			if (num == 2)
				break;
			break;
		}
		default:
			break;
		}

	} while (num != 1);
}